In [65]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

### Column 선택

#### 이름 / 주소 / 이름,주소,점수

In [72]:
df['주소']

번호
1번    광주
2번    서울
3번    대구
4번    대전
5번    광주
6번    서울
Name: 주소, dtype: object

In [75]:
df['']

이름     이길동
주소      서울
나이      23
점수      88
언어    Java
Name: 2번, dtype: object

번호
1번    광주
2번    서울
3번    대구
4번    대전
5번    광주
6번    서울
Name: 주소, dtype: object

In [76]:
df[['이름','주소']]

     이름  주소
번호
1번  김길동  광주
2번  이길동  서울
3번  강길동  대구
4번  홍길동  대전
5번  박길동  광주
6번  나길동  서울

#### 컬럼 전체 출력 / 특정 컬럼 선택 / 특정 컬럼으로 데이터 출력

In [78]:
df.columns

Index(['이름', '주소', '나이', '점수', '언어'], dtype='object')

In [80]:
df.columns[0]

'이름'

In [81]:
df.columns[1]

'주소'

In [83]:
df['나이']

번호
1번    33
2번    23
3번    30
4번    20
5번    21
6번    25
Name: 나이, dtype: int64

In [84]:
df['언어']

번호
1번    Python
2번      Java
3번       C++
4번       NaN
5번       NaN
6번         C
Name: 언어, dtype: object

번호
1번    Python
2번      Java
3번       C++
4번       NaN
5번       NaN
6번         C
Name: 언어, dtype: object

### 슬라이싱

In [10]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

#### 점수 컬럼의 특정 인덱스까지 출력

In [85]:
df['점수'][:4]

번호
1번     76
2번     88
3번     98
4번    100
Name: 점수, dtype: int64

번호
1번     76
2번     88
3번     98
4번    100
Name: 점수, dtype: int64

In [86]:
df['점수'][:3]

번호
1번    76
2번    88
3번    98
Name: 점수, dtype: int64

번호
1번    76
2번    88
3번    98
Name: 점수, dtype: int64

In [87]:
df['점수'][2:]

번호
3번     98
4번    100
5번     60
6번     90
Name: 점수, dtype: int64

번호
3번     98
4번    100
5번     60
6번     90
Name: 점수, dtype: int64

In [88]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

#### 이름과 점수 컬럼의 특정 인덱스까지 출력

In [89]:
df[['이름','점수']][:3]

     이름  점수
번호
1번  김길동  76
2번  이길동  88
3번  강길동  98

In [90]:
df[3:]

     이름  주소  나이   점수   언어
번호
4번  홍길동  대전  20  100  NaN
5번  박길동  광주  21   60  NaN
6번  나길동  서울  25   90    C

In [23]:
df[3:]

     이름  주소  나이   점수   언어
번호
4번  홍길동  대전  20  100  NaN
5번  박길동  광주  21   60  NaN
6번  나길동  서울  25   90    C

### 데이터선택(loc)

In [24]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

#### 3번 인덱스 행 출력 / 5번 인덱스 행 출력

In [93]:
df.loc['3번']

이름    강길동
주소     대구
나이     30
점수     98
언어    C++
Name: 3번, dtype: object

이름    강길동
주소     대구
나이     30
점수     98
언어    C++
Name: 3번, dtype: object

In [94]:
df.loc['5번']

이름    박길동
주소     광주
나이     21
점수     60
언어    NaN
Name: 5번, dtype: object

이름    박길동
주소     광주
나이     21
점수     60
언어    NaN
Name: 5번, dtype: object

#### 1번 인덱스의 점수 컬럼값 출력

In [95]:
df.loc['1번','점수']

np.int64(76)

np.int64(76)

#### 1번과 3번 인덱스의 나이 컬럼 값 출력

In [96]:
df.loc[['1번','3번'],'나이']

번호
1번    33
3번    30
Name: 나이, dtype: int64

In [97]:
df.loc[['1번','3번'],['이름','나이']]

     이름  나이
번호
1번  김길동  33
3번  강길동  30

#### 1번과 3번 인덱스의 이름과 나이 컬럼값 출력

     이름  나이
번호
1번  김길동  33
3번  강길동  30

#### 1번부터 4번 인덱스까지의 이름부터 나이까지 컬럼값 출력

In [98]:
df.loc['1번':'4번','이름':'나이']

     이름  주소  나이
번호
1번  김길동  광주  33
2번  이길동  서울  23
3번  강길동  대구  30
4번  홍길동  대전  20

In [105]:
df.iloc[1:4,1:3]

    주소  나이
번호
2번  서울  23
3번  대구  30
4번  대전  20

     이름  주소  나이
번호
1번  김길동  광주  33
2번  이길동  서울  23
3번  강길동  대구  30
4번  홍길동  대전  20

### 데이터선택(iloc)

In [4]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [5]:
df.iloc[0]

이름       김길동
주소        광주
나이        33
점수        76
언어    Python
Name: 1번, dtype: object

In [6]:
df.iloc[1,2]

np.int64(23)

In [7]:
df.iloc[[1,3], 3:]

     점수    언어
번호
2번   88  Java
4번  100   NaN

In [9]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [8]:
df.iloc[1:4, 2:5]

    나이   점수    언어
번호
2번  23   88  Java
3번  30   98   C++
4번  20  100   NaN